Revit 2027 API
ParameterTypeId.BoundaryAreaRestraintY Property
 "Y Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryAreaRestraintY { get; }
Public Shared ReadOnly Property BoundaryAreaRestraintY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryAreaRestraintY {
	ForgeTypeId^ get ();
}
static member BoundaryAreaRestraintY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace